Removed mermaid from the docs in favor of plantuml.
